project/Egypt/webservice interface20180517/ConcentratorAccess/req_get_schedule_task_info.xml

<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
   <S:Header>
      <ResourceURI xmlns="http://www.energiened.nl/Content/Publications/dsmr/P32">http://www.energiened.nl/Content/Publications/dsmr/P32/ metersDirectory</ResourceURI>
   </S:Header>
   <S:Body>
      <ns3:Create xmlns:ns5="http://www.energiened.nl/Content/Publications/dsmr/P32" xmlns:ns4="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:ns3="http://schemas.xmlsoap.org/ws/2006/08/resourceTransfer" xmlns:ns2="http://www.w3.org/2005/08/addressing" xmlns="http://schemas.xmlsoap.org/ws/2004/08/addressing">

         <ns4:Metadata>
            <ns4:MetadataSection>
               <ns3:Metadata>
                  <ns3:Lifetime>
                     <ns3:TerminateAt>
					<ns3:TerminationTime>2015-11-23T17:57:21-02:00</ns3:TerminationTime>
                     </ns3:TerminateAt>
                  </ns3:Lifetime>
               </ns3:Metadata>
            </ns4:MetadataSection>
         </ns4:Metadata>
         <ns3:Fragment>
            <ns3:Expression>p32:ConcentratorAccess</ns3:Expression>
            <ns3:Value>
               <ns5:ConcentratorAccess>
               	<ns5:ConcentratorService/>
               	<ns5:EventLog/>
               	<ns5:Status>
               		<ns5:Indent Value="GetScheTaskInfo" Password="000000"/> <!--Get schedule task fail rate information for specified meters in specified days-->
               		<ns5:Status>
               			<ns5:SelectiveAccess>
               			<!--date format is yyyy-mm-dd，meterid is in decimal format-->
	               			<ns5:DateInterval>
	               			<ns5:StartDate>2015-11-05</ns5:StartDate>
	               			<ns5:EndDate>2015-11-06</ns5:EndDate>
		               		</ns5:DateInterval>
											<ns5:MeterList>
												<ns5:MeterId>122</ns5:MeterId>
												<ns5:MeterId>16</ns5:MeterId>
											</ns5:MeterList>
											</ns5:SelectiveAccess>
               		</ns5:Status>
                  </ns5:Status>
               </ns5:ConcentratorAccess>
            </ns3:Value>
         </ns3:Fragment>
      </ns3:Create>
   </S:Body>
</S:Envelope>